testing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

DebugSwitches
{
	SolverPerformance 0;
}
/*
functions
{
    	scalar3
		{
		
		type scalarTransport;
		libs ("libsolverFunctionObjects.so");
		enabled true;
		writeControl timeStep;
		writeInterval 500;
		log yes;
		nCorr 2;
		DT 2.5e-05;
		field T;
		fvOptions
		{
			scalar3
			{
				type	scalarFixedValueConstraint;
				active	true;
				
				scalarFixedValueConstraintCoeffs
				{
					timeStart		0;
					duration		100000;
					selectionMode	cellZone;
					cellZone		source1;
					
					fieldValues
						{
						T 1;
						}
				}
			}
		}
		
		}

}*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
