testing/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       115420;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       115520;
    }
    wall
    {
        type            symmetry;
        nFaces          560;
        startFace       115620;
    }
    obstacle
    {
        type            wall;
        nFaces          400;
        startFace       116180;
    }
    frontAndBack
    {
        type            symmetry;
        nFaces          116000;
        startFace       116580;
    }
)

// ************************************************************************* //
