testing/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0067;

boundaryField
{
    inlet
    {
        type            calculated;
	value		$internalField;
    }

    outlet
    {
        type            calculated;
	value		$internalField;
    }

    wall
    {
        type		symmetry;
    }

    frontAndBack
    {
    	type		symmetry;
    }

    
    obstacle
    {
        type            fixedValue;
	value		uniform 0;
    }
}


// ************************************************************************* //
