testing/0/fTSource
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fTSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type		fixedValue;
        value           uniform 0;
    }

    outlet
    {
    	type		zeroGradient;
    }
    
    wall
    {
 	type		symmetry;
    }

   frontAndBack 
    {
        type           symmetry;
    }

    obstacle  
    {
        type            fixedValue;
        value	  uniform 0;
    }
}


// ************************************************************************* //
